1. 	
Hockey India Executive Board held an Emergent Executive Board meeting named Gyanendro Ningombam as the Officiating President of Hockey India. He is from which state?

A.	MP
B.	Haryana
C.	Manipur
D.	Punjab
Answer: Option C


2. 	
Prime Minister Narendra Modi inaugurated the 750 MW Solar Project set up in which state?

A.	Odisha
B.	Bihar
C.	Madhya Pradesh
D.	UP
Answer: Option C

3. 	
Which state Chief Minister was honoured with Paul Harris Fellow recognition?

A.	Kerala
B.	Bihar
C.	Haryana
D.	Tamil Nadu
Answer: Option D


4. 	
Which state organised India's first e-Lok Adalat to ensure the administration of justice and to solve the financial crisis of the parties and lawyers amid COVID-19 pandemic?

A.	Bihar
B.	Chhattisgarh
C.	Gujarat
D.	MP
Answer: Option B


5. 	
Which state goevrnment has approved a new startup policy recently?

A.	UP
B.	Bihar
C.	Maharashtra
D.	Haryana
Answer: Option A6. 	
Which state has inaugurated 5 water supply prpjects recently?

A.	Manipur
B.	Mahdya Pradesh
C.	Gujarat
D.	Assam
Answer: Option A


7. 	
Maharashtra governemnt will set up stress fund with the help of which bank?

A.	SBI
B.	RBI
C.	Yes Bank
D.	HDFC Bank
Answer: Option A


8. 	
Who has inaugurated Rewa Ultra Mega Solar Power Project in Madhya Pradesh?

A.	Amit Shah
B.	Raj Nath Singh
C.	Narendra Modi
D.	Nitin Jairam Gadkari
Answer: Option C


9. 	
Which State Chief Minister launched the BLUIS, a flagship development of the General Administration and Public grievances departments?

A.	Madhya Pradesh
B.	Karnataka
C.	Odisha
D.	West Bengal
Answer: Option C


10. 	
Which State launched the week long campaign "Pure for Sure" from 8th July 2020 to 14th July 2020 - to ensure the purity of the milk and dairy products?

A.	Jammu and Kashmir
B.	Bihar
C.	Rajasthan
D.	Gujarat
Answer: Option C

6. 	
Which state has inaugurated 5 water supply prpjects recently?

A.	Manipur
B.	Mahdya Pradesh
C.	Gujarat
D.	Assam
Answer: Option A

Explanation:

Manipur Chief Minister (CM) N. Biren Singh inaugurates 5 Water Supply projects worth Rs 48.39 crore, which have a total capacity of more than 26.15 millions of liters per day(MLD) through video conferencing from the Chief Minister's Secretariat, Imphal. With addition to the projects one office building of Weight and Measures Department and Rapid Antigen Detection Testing Centre at Jiribam were also inaugurated.
View Answer Discuss in Forum Workspace Report
7. 	
Maharashtra governemnt will set up stress fund with the help of which bank?

A.	SBI
B.	RBI
C.	Yes Bank
D.	HDFC Bank
Answer: Option A

Explanation:

Maharashtra Housing Minister Jitendra Awhad announced that the state govt and State Bank of India (SBI) will set up a stress fund to revive Slum Rehabilitation Authority (SRA) projects (about 370 projects) in the Mumbai Metropolitan Region (MMR) and other urban areas of the state. For this purpose, the state govt will inject Rs 700 crore to Rs 1,000 crore in this fund as a financial support. SRA will act as the nodal agency under the Housing Ministry to implement the slum redevelopment schemes.
View Answer Discuss in Forum Workspace Report
8. 	
Who has inaugurated Rewa Ultra Mega Solar Power Project in Madhya Pradesh?

A.	Amit Shah
B.	Raj Nath Singh
C.	Narendra Modi
D.	Nitin Jairam Gadkari
Answer: Option C


9. 	
Which State Chief Minister launched the BLUIS, a flagship development of the General Administration and Public grievances departments?

A.	Madhya Pradesh
B.	Karnataka
C.	Odisha
D.	West Bengal
Answer: Option C

10. 	
Which State launched the week long campaign "Pure for Sure" from 8th July 2020 to 14th July 2020 - to ensure the purity of the milk and dairy products?

A.	Jammu and Kashmir
B.	Bihar
C.	Rajasthan
D.	Gujarat
Answer: Option C

11. 	
Which State government has imposed statewide lockdown from 10th July to 13th July 2020 to check the spread of novel Coronavirus and other communicable diseases?

A.	Rajasthan
B.	Uttar Pradesh
C.	Karnataka
D.	Tamil Nadu
Answer: Option B


12. 	
Bar Council of Delhi has requested PM Narendra Modi for financial assistance of how much under the PM Cares Fund and Contingency Fund to help the advocates in Delhi NCR?

A.	Rs 500 crore
B.	Rs 200 crore
C.	Rs 300 crore
D.	Rs 250 crore
Answer: Option A

13. 	
According to data from the Reserve Bank of India, which State has topped market borrowings among States in India with a collection of Rs.30,500 crore in the fiscal 2020-21?

A.	Tamil Nadu
B.	Haryana
C.	Andhra Pradesh
D.	West Bengal
Answer: Option A

14. 	
World's 2nd Largest & Asia's Largest Data Center, 'Yotta NM1 Data Center' of Yotta Infrastructure of Hiranandani Group is located in which Indian state?

A.	Madhya Pradesh
B.	Maharashtra
C.	Bihar
D.	Haryana
Answer: Option B


15. 	
A 3 member team has discovered a new species of a fan-throated lizard, Sitana dharwarensis, from the barren lands of which Indian state?

A.	Karnataka
B.	Telangana
C.	Andhra Pradesh
D.	Uttar Pradesh
Answer: Option A

16. 	
Who unveiled Bhubaneswar Land Use Intelligence System which would monitor changes in all government lands in Odisha by leveraging high-resolution satellite imagery?

A.	Hemananda Biswal
B.	Giridhar Gamang
C.	Janaki Ballabh Pattanaik
D.	Naveen Patnaik
Answer: Option D


17. 	
Which Indian State celebrated Rythu Dinotsavam (Farmer's Day) to mark the 71st birth anniversary of YS Rajasekhara Reddy?

A.	Karnataka
B.	Telangana
C.	Odisha
D.	Andhra Pradesh
Answer: Option D

18. 	
Which State chief minister launched the 'Maha Jobs Portal' an online platform to provide employment opportunities to local residents of the state by connecting job seekers with employers?

A.	Telangana
B.	Maharashtra
C.	West Bengal
D.	Odisha
Answer: Option B


19. 	
"Intzaar Aap Ka" campaign is started by which state over the social media platform to attract tourists with taglines and the description of the tourism destinations of the State?

A.	Rajasthan
B.	Gujarat
C.	Madhya Pradesh
D.	Punjab
Answer: Option C


20. 	
Which State government has decided to upgrade the 111.942 sq km Dehing Patkai Wildlife Sanctuary into a national park which is located within the larger Dehing Patkai Elephant Reserve?

A.	Assam
B.	Maharashtra
C.	West Bengal
D.	Odisha
Answer: Option A

21. 	
Which State Chief Minister launches "SelfScan" app developed by the state's Information Technology department as an alternative to Camscanner?

A.	West Bengal
B.	Jharkhand
C.	Karnataka
D.	Uttar Pradesh
Answer: Option A


22. 	
Which State launched "Weavers Samman Yojana" to provide financial assistance of Rs 2000 for about 19,744 handloom weavers in the state, through Direct Benefit Transfer?

A.	Madhya Pradesh
B.	Jharkhand
C.	Karnataka
D.	Uttar Pradesh
Answer: Option C


23. 	
Which Indian State has become the first state where all the households have LPG gas connections?

A.	Himachal Pradesh
B.	Arunachal Pradesh
C.	Madhya Pradesh
D.	Uttar Pradesh
Answer: Option A


24. 	
Which State Cabinet has approved the draft ordinance for reservation of 75% jobs in private sector for youth of the state?

A.	Haryana
B.	Bihar
C.	Jharkhand
D.	Punjab
Answer: Option A


25. 	
Which State/UTs launched Mission Organic Development Initiative and Greenhouse Project, to lead on a sustainable path, over a virtual platform?

A.	Punjab
B.	Haryana
C.	Delhi
D.	Ladakh
Answer: Option D


26. 	
PM Narendra Modi will on July 10, 2020 inaugurate the Asia's largest solar power plant in which state?

A.	Madhya Pradesh
B.	Bihar
C.	Rajasthan
D.	Haryana
Answer: Option A


27. 	
World's largest 10,000-bed Sardar Patel COVID Care Centre is inaugurated in which city?

A.	Chennai
B.	Mumbai
C.	Delhi
D.	Gurugram
Answer: Option C


28. 	
The Administration of the Union Territory of Ladakh launched the Ladakh Food Security Scheme. Who is current Lieutenant Governor of Union Territory of Ladakh?

A.	Jagdish Mukhi
B.	Biswa Bhusan Harichandan
C.	Phagu Chauhan
D.	Radha Krishna Mathur
Answer: Option D


29. 	
The UK India Business Council signed a Memorandum of Understanding with which state Industrial Development Corporation?

A.	Uttar Pradesh
B.	Bihar
C.	Haryana
D.	Maharashtra
Answer: Option D


30. 	
Which State/ UT Government has launched an e-learning portal name as LEAD which comprises of 10,000 instructional materials and course content for students of Classes I to XII?

A.	Punjab
B.	Delhi
C.	Haryana
D.	Goa
Answer: Option B

