1. 	
The Indian Army is soon going to place emergency orders for cold weather tents for soldiers at the Line of Actual Control. Who is current Chief of the Army Staff?

A.	Bikram Singh
B.	Dalbir Singh Suhag
C.	Bipin Rawat
D.	Manoj Mukund Naravane
Answer: Option D


2. 	
Defence Acquisition Council has given its consent for the capital acquisition of various platforms and equipment required by the Indian Armed Forces of how much worth?

A.	Rs 48,900 crore
B.	Rs 38,900 crore
C.	Rs 58,900 crore
D.	Rs 18,900 crore
Answer: Option B


3. 	
Indian Navy and which country's Navy have conducted a day long Naval Exercise PASSEX for tactical and communications training, towards the Malacca Strait in the Indian Ocean Region?

A.	China
B.	Japan
C.	Russia
D.	France
Answer: Option B


4. 	
What is the name of Advanced Torpedo Decoy System that is capable of being fired from all frontline warships, inducted reccently by Indian Navy?

A.	Maareech
B.	Shastra
C.	Brahastra
D.	Ravana
Answer: Option A


5. 	
Indian Navy has inducted indigenously developed Torpedo Decoy System on 26 June 2020. Who is current Chief of the Naval Staff?

A.	S. M. Nanda
B.	M. S. Pawar
C.	G Ashok Kumar
D.	Karambir Singh
Answer: Option D


6. 	
The Central Government has granted special financial powers of how much Rs as emergency funds to armed forces for war preparedness amid ongoing border tensions with China?

A.	Rs 750 crore
B.	Rs 1000 crore
C.	Rs 1500 crore
D.	Rs 500 crore
Answer: Option D


7. 	
Who inaugurated a two-day digital conference on the defence & aerospace manufacturing sector Defence Conclave 2020, Gujarat via video conference on 26 June?

A.	Shripad Naik
B.	Narendra Singh Tomar
C.	Raj Nath Singh
D.	D.V. Sadananda Gowda
Answer: Option A


8. 	
Researchers from which institute has traced the paleoclimatic history of the Indus River in Ladakh Himalaya?

A.	Centre for Economic and Social Studies
B.	Tata Institute of Fundamental Research
C.	Wadia Institute of Himalayan Geology
D.	Malaviya National Institute of Technology
Answer: Option C


9. 	
India has joined as a founding member and launched the GPAI. What is full form of P in GPAI?

A.	Programme
B.	Partnership
C.	Plan
D.	Purposed
Answer: Option B


10. 	
Which Indian navy ship reached Port Victoria in Seychelles to provide COVID-19 related medicines under Mission Sagar?

A.	Talwar
B.	Vikramaditya
C.	Shivalik
D.	Kesari
Answer: Option D


11. 	
The Indian Navy has set up an Ultraviolet sanitisation Bay at which dockyard to decontaminate the coveralls, tools, personal gadgets, masks, cloths?

A.	Kolkata
B.	Mumbai
C.	Kochi
D.	Visakhapatnam
Answer: Option B


12. 	
Ministry of Defence (MoD) has approved the procurement of how many items only from local suppliers to boost the "Make in India" initiative?

A.	12
B.	16
C.	26
D.	22
Answer: Option C


13. 	
Lt. General PS Rajeshwar has commissioned the 103rd Landing Craft Utility (LCU) MK IV class vessel 'INLCU L 57' into the Indian Navy at which port?

A.	Mormugao Port
B.	Port Blair Port
C.	Tuticorin port
D.	Mumbai Port
Answer: Option B


14. 	
India saved Rs 89,122 crore through energy efficiency initiatives by BEE (Bureau of Energy Efficiency) in 2018-19. Who is current Union Minister of Power?

A.	Jitendra Singh
B.	Prahalad Singh Patel
C.	Mansukh L. Mandaviya
D.	R K Singh
Answer: Option D
 

15. 	
What is the name of Operation launched by Indian Navy, as a part of a national effort to repatriate Indian citizens from overseas?

A.	Samudra Setu
B.	COVID-Help
C.	Samudra Help
D.	COVID Setu
Answer: Option A


16. 	
The Indian Navy has launched which operation as a part of the nation's efforts to bring back Indian citizens from abroad?

A.	Samudra Setu
B.	Samudra Shakti
C.	Samudra Care
D.	Samudra Help
Answer: Option A


17. 	
Border Roads Organisation (BRO) opened the strategic Srinagar-Leh highway on 11 April. When was Border Road Organisation Formed?

A.	1950
B.	1947
C.	1957
D.	1960
Answer: Option D


18. 	
What is the new deadline for qualification period of Tokyo Olympics?

A.	June 1, 2021
B.	June 29, 2021
C.	July 29, 2021
D.	July 1, 2021
Answer: Option B

19. 	
Joint patrol exercise from the Reunion Island has been conducted by India with which country?

A.	Australia
B.	France
C.	Mauritius
D.	Maldives
Answer: Option B


20. 	
Marines and Emirati forces conducted the biennial exercise, named Native Fury at which place?

A.	Singapore
B.	Dubai
C.	Kathmandu
D.	Abu Dhabi
Answer: Option D


21. 	
The Indian Institute of Technology, Kanpur and Which of the following companies have collaborated to carry out joint research in industrial and infrastructure cybersecurity?

A.	Reliance
B.	L&T Technology
C.	Tech Mahindera
D.	TCS
Answer: Option B


22. 	
The DAC has approved procurement of how many Tejas fighter aircraft?

A.	73
B.	79
C.	83
D.	89
Answer: Option C


23. 	
It has been directed to grant permanent commission to serving women officers in Navy within how many months with increments?

A.	8 months
B.	3 months
C.	6 months
D.	12 months
Answer: Option B


24. 	
Which of the following has unveiled the renovated Animal Memorial at Agram Grounds in ASC Centre and College in Bengaluru?

A.	Indian Air Force
B.	Indian Army
C.	Naval Guard
D.	Indian Navy
Answer: Option B


25. 	
Indradhanush joint exercise between IAF and UK's Royal Air Force recently concluded in which city?

A.	Odisha
B.	Uttar Pradesh
C.	Rajasthan
D.	Uttarakhand
Answer: Option B


26. 	
Ajeya Warrior 2020, a joint military exercise was recently concluded between India and which country?

A.	USA
B.	Malaysia
C.	UK
D.	Japan
Answer: Option C


27. 	
Which country has successfully tested Ra'ad-II cruise missile?

A.	Iran
B.	Pakistan
C.	Israel
D.	UAE
Answer: Option B


28. 	
SAMPRITI-IX, a joint military exercise between India and Bangladesh recently concluded in which state?

A.	Nagaland
B.	Meghalaya
C.	Assam
D.	Mizoram
Answer: Option B


29. 	
According to IISS's annual "Military Balance" report, global spending on defence in 2019 has risen by what amount?

A.	3%
B.	4%
C.	5%
D.	6%
Answer: Option B


30. 	
Who presented Colour to INS Shivaji?

A.	Ram Nath Kovind
B.	Karambir Singh
C.	Narendra Modi
D.	Sunil Lamba
Answer: Option A


31. 	
Which edition of joint military exercise "Ajeya Warrior" between India and UK is to be held?

A.	3rd
B.	4th
C.	5th
D.	6th
Answer: Option C


32. 	
Who takes over as Flag Officer Commanding Gujarat Naval Area?

A.	Puruvir Das
B.	Girish Kumar
C.	Nathu Singh
D.	Sanjay Roye
Answer: Option A


33. 	
'Ajeya Warrior', a joint military exercisebetween India and UK is to be conducted at which place?

A.	Ladakh
B.	Salisbury Plains
C.	Kohima
D.	Avebury
Answer: Option B


34. 	
'Ajeya Warrior', a joint military exercise is to be conducted between India and which country?

A.	Japan
B.	UK
C.	France
D.	South Korea
Answer: Option B

35. 	
What is the strike range of DRDO's newly developed tactical ballistic missile 'Pranash'?

A.	100 kms
B.	150 kms
C.	200 kms
D.	250 kms
Answer: Option C


36. 	
Which of the following signed MoU with PSU Bharat Dynamics Limited to explore co-production of Javelin anti-tank guided missile system in India?

A.	Northrop Grumman
B.	Lockheed Martin
C.	Thales Group
D.	McDonnell Douglas
Answer: Option B


37. 	
India is looking forward to develop a new tactical ballistic missile with a range of how much?

A.	100 kms
B.	150 kms
C.	200 kms
D.	250 kms
Answer: Option C


38. 	
Which indigenous 180 km strike range air to ground missile has been newly launched by Indian firm JSR Dynamics?

A.	Nirbhya
B.	K101
C.	Sanrakhan
D.	Khagantak
Answer: Option D


39. 	
Who is to assume charge as new Northern Command chief?

A.	Satish Dua
B.	YK Joshi
C.	DeependraHooda
D.	Nathu Singh
Answer: Option B


40. 	
SAMPRITI-IX, is a joint military training exercise between India and which country?

A.	Nepal
B.	Maldives
C.	Bangladesh
D.	Sri Lanka
Answer: Option C


41. 	
The Indian Navy conducted the Coastal Security Exercise, Malta Abhiyan in which city?

A.	Bhubneshwar
B.	Patna
C.	Jaipur
D.	Kolkata
Answer: Option D


42. 	
Which of the following recently launched Operation Vanilla?

A.	Indian Army
B.	Indian Navy
C.	Indian Air Force
D.	Naval Guard
Answer: Option B


43. 	
NASA has chosen_________ to build first habitable commercial module for ISS?

A.	Blue Origin
B.	Axiom Space
C.	Space Adventures
D.	Virgin Galactic
Answer: Option B

44. 	
Who won the first prize among the marching contingents of the paramilitary forces at the Republic Day parade?

A.	ITBP
B.	BSF
C.	CISF
D.	SSB
Answer: Option C


45. 	
Which nuclear-capable surface-to-surface ballistic missile was recently test fired by Pakistan?

A.	Shaheen-III
B.	Ghaznavi
C.	Ababeel
D.	Harbah
Answer: Option B


46. 	
Which artillery gun is to be inducted into the Indian Army after its successful test at Gun Carriage Factory, Jabalpur?

A.	Sharang
B.	Dhanush Howitzer
C.	2S1 Gvozdika
D.	Pinaka MBRL
Answer: Option A


47. 	
With which of the following Indian Navy hassigned MoU for sharing of offshore data?

A.	Indian Meteorological Department
B.	Oil and Natural Gas Corporation
C.	National Geophysical Research Institute
D.	Geological Survey of India
Answer: Option D


48. 	
Which aircraft has been included in the IAF's 'Tigersharks' 222 squadron?

A.	Dassault Rafale
B.	HAL Tejas
C.	F-16 Fighting Falcon
D.	Sukhoi-30 MKI
Answer: Option D

49. 	
Which ballistic missile has been successfully tested by DRDO from an underwater platform?

A.	Agni-II
B.	Pralay
C.	K-4
D.	Surya
Answer: Option C


50. 	
Which of the following conducted the exercise Winged Raider?

A.	Indian Army
B.	Indian Navy
C.	Indian Air Force
D.	Naval Guard
Answer: Option A


51. 	
How many aircrafts are to be acquired by the government for Indian Air Force?

A.	100
B.	150
C.	200
D.	250
Answer: Option C


52. 	
'Operation Sankalp' is associated with which force?

A.	Indian Army
B.	Indian Navy
C.	Indian Air Force
D.	Naval Guard
Answer: Option B

53. 	
Which of the following is to host naval event MILAN?

A.	Visakhapatnam
B.	Kochi
C.	Chennai
D.	Mumbai
Answer: Option A


54. 	
Which of the following began its work to improve efficiency based on the GOCO model?

A.	Indian Army
B.	Indian Navy
C.	Indian Air Force
D.	Naval Guard
Answer: Option A


55. 	
Which of the following has launched expedition in Maharashtra to promote the heritage of India?

A.	Indian Army
B.	Indian Navy
C.	Indian Air Force
D.	Naval Guard
Answer: Option B


56. 	
Naseem-Al-Bahr, abilateral naval exercise is between India and which country?

A.	Bahrain
B.	Kuwait
C.	Qatar
D.	Oman
Answer: Option D


57. 	
Whose tenure has been extended as BSF IG?

A.	Abhinav Kumar
B.	Manish Shankar Sharma
C.	Niraj Sinha
D.	Alok Verma
Answer: Option A

58. 	
By what name MiG-27 was known to Indian Air Force?

A.	Sherkhan
B.	Bahadur
C.	Flogger
D.	Shershah
Answer: Option B


59. 	
Which one is the name given to the largest ever anti hijacking exercise of India, conducted recently at Kochi?

A.	Raksha
B.	Samarth
C.	Rehaan
D.	Apharan
Answer: Option D


60. 	
Which guided rocket system was recently launched for Odisha coast?

A.	Agni
B.	Pinaka
C.	Naag
D.	Akash
Answer: Option B


61. 	
SURYA KIRAN is a joint military exercise of India with which country?

A.	Nepal
B.	China
C.	USA
D.	Maldives
Answer: Option A

62. 	
Which medium-range ramjet supersonic cruise missile has recently been successfully test-fired from a base in Odisha's Chandipur?

A.	BrahMos
B.	Prithvi
C.	Agni-II
D.	Akash
Answer: Option A


63. 	
Who is to become the next chief of the Indian Army?

A.	Sunil Lamba
B.	Bipin Rawat
C.	Manoj Mukund Naravane
D.	Karambir Singh
Answer: Option C


64. 	
Which paramilitary force has launced matrimonial site for its staff?

A.	CISF
B.	CRPF
C.	ITBP
D.	RPF
Answer: Option C


65. 	
Military Literature Festival was organized at which city?

A.	Chandigarh
B.	Indore
C.	Aizawl
D.	Mumbai
Answer: Option A


66. 	
International Seminar cum Exhibition on Naval Weapon Systems 'NAVARMS - 2019' is being held in which of the following cities?

A.	Bhopal
B.	New Delhi
C.	Cuttack
D.	Visakhapatnam
Answer: Option B


67. 	
Iron Union 12, is a joint military exercise between UAE and which of the following countries?

A.	France
B.	India
C.	Russia
D.	USA
Answer: Option D


68. 	
India with which country is to begin joint naval patrolling mission in Indian ocean region?

A.	Germany
B.	Israel
C.	France
D.	Australia
Answer: Option C


69. 	
The fourth edition of the International Seminar cum Exhibition NAVARMS-19 is to be held in which city?

A.	Jaipur
B.	Chandigarh
C.	New Delhi
D.	Bhopal
Answer: Option C


70. 	
As per the latest SIPRI Report, which is the largest Arms manufacturer in the world?

A.	Thales
B.	General Dynamics
C.	L-3 Technologies
D.	Lockheed Martin
Answer: Option D


71. 	
Hand in Hand 2019: A joint military exercise is between India and which country?

A.	China
B.	Japan
C.	Singapore
D.	South Korea
Answer: Option A


72. 	
How many projects have been approved by the government for setting up FM transmitters in the premises of SSB along the Indo-Nepal border?

A.	7
B.	5
C.	15
D.	17
Answer: Option A


73. 	
INDRA, a Joint tri service exercise is between India and which of the following countries?

A.	France
B.	Russia
C.	USA
D.	China
Answer: Option B


74. 	
Indian army's Sindhu Sudarshan exercise recently concluded in which state?

A.	Arunachal Pradesh
B.	Assam
C.	Andhra Pradesh
D.	Rajasthan
Answer: Option D

rt
75. 	
What is the range of nuclear-capable Prithvi-II missile?

A.	350 kms
B.	400 kms
C.	450 kms
D.	500 kms
Answer: Option A
