1. 	
Hagia Sophia Museum is in which country?

A.	Saudi Arabia
B.	Turkey
C.	UAE
D.	Kuwait
Answer: Option B


2. 	
Tropical Storm Fay hits which country?

A.	USA
B.	Bangladesh
C.	Sri Lanka
D.	Chile
Answer: Option A


3. 	
Who is the prime minister of Singapore?

A.	Revi Seing
B.	Lee Hsien Loong
C.	Adam Hsien Loong
D.	Kvi Tser Hueng
Answer: Option B


4. 	
Which country has become the second largest Foreign Direct Investor in the United Kingdom (UK)after the United States in 2019?

A.	USA
B.	UAE
C.	India
D.	China
Answer: Option C


5. 	
Which Organization has formulated an Independent Panel for Pandemic Preparedness and Response (IPPR) to evaluate the world's response to the COVID-19 pandemic?

A.	GEF
B.	FAO
C.	WHO
D.	UNICEF
Answer: Option C


6. 	
Master has announced to invest what amount to support Indian MSME?

A.	Rs 350 crore
B.	Rs 200 crore
C.	Rs 250 crore
D.	Rs 100 crore
Answer: Option C

7. 	
Which bank has signed a MoU to increase the collaboration on sustainability with a focus on energy sector resilience in Asia and the Pacific?

A.	AIIB
B.	ADB
C.	World bank
D.	RBI
Answer: Option B


8. 	
The cable TV operators of which country have banned all the news channels of India, except Doordarshan?

A.	Pakistan
B.	Nepal
C.	Bhutan
D.	Sri Lanka
Answer: Option B


9. 	
Which Arab nation announced to send probe to Mars to capture comprehensive image of the weather in the atmosphere of Mars?

A.	United Arab Emirates
B.	Jordan
C.	Morocco
D.	Saudi Arabia
Answer: Option A


10. 	
Which country became the first industrialized country to phase out of both coal and nuclear energy?

A.	France
B.	India
C.	Germany
D.	China
Answer: Option C


11. 	
In order to bolster the comprehensive strategic partnership a MoU has been signed between the Indian Coast Guard and which country on 'Maritime Safety and Security'?

A.	Vietnam
B.	Thailand
C.	Indonesia
D.	Malaysia
Answer: Option C


12. 	
A new four-storey school building, developed with the Indian assistance of Rs 1.94 crore has been inaugurated in which country?

A.	Nepal
B.	Bhutan
C.	Sri Lanka
D.	China
Answer: Option A


13. 	
In order to strengthen the bilateral development partnership, the Government of India has inked 5 Memorandam of understanding with which country under the former's high impact community development projects programme?

A.	Israel
B.	Afghanistan
C.	Nepal
D.	Bhutan
Answer: Option B


14. 	
Which country has successfully launched a new spy satellite "Ofek 16" into orbit by using a locally-developed Shavit rocket?

A.	Pakistan
B.	China
C.	Russia
D.	Israel
Answer: Option D


15. 	
Which country has reported a suspected case of Bubonic Plague on July 5, 2020?

A.	USA
B.	UAE
C.	China
D.	Brazil
Answer: Option C


16. 	
Syama Prasad Mookerjee Port has started a new shipping service between Kolkata Dock System and which country?

A.	Bangladesh
B.	Vietnam
C.	Thailand
D.	Myanmar
Answer: Option A


17. 	
The Indian Railways and RailTel signed a MoU for installation of an IP-based video surveillance system at how many railway stations across the country?

A.	2,049
B.	3,049
C.	4,049
D.	6,049
Answer: Option D


18. 	
Who launched the 'Aatma Nirbhar Bharat App Innovation Challenge' for Indian tech entrepreneurs and startups?

A.	Narendra Modi
B.	Nitin Jairam Gadkari
C.	Raj Nath Singh
D.	Amit Shah
Answer: Option A


19. 	
Who has been appointed as the new Prime Minister of France?

A.	Annalisa Tardino
B.	Angelo Ciocca
C.	Matteo Adinolfi
D.	Jean Castex
Answer: Option D


20. 	
Who launched the "Fit Hai To Hit Hai India" webinar program?

A.	Thaawar Chand Gehlot
B.	Nirmala Sitharaman
C.	Kiren Rijiju
D.	Narendra Singh Tomar
Answer: Option C


21. 	
Edouard Phillipe Prime Minister of which country resigned during the expected government reshuffle?

A.	Germany
B.	Russia
C.	France
D.	Italy
Answer: Option C


22. 	
Who has won Russian electorate and will become President until 2036?

A.	Vladimir Putin
B.	Mikhail Mishustin
C.	Andrey Belousov
D.	Viktoria Abramchenko
Answer: Option A


23. 	
Which country became the first African country to submit the results for Reducing Emissions from Deforestation and forest Degradation to the United Nations Framework Convention on Climate Change?

A.	Uganda
B.	Burundi
C.	Angola
D.	Cameroon
Answer: Option A


24. 	
The WTO Dispute Settlement Body has established a panel after the European Union has dragged which country into the Dispute Settlement System of WTO for the second time against import duties on information and communication technology products?

A.	Pakistan
B.	China
C.	India
D.	Sri Lanka
Answer: Option C


25. 	
Who has been elected as president of Iceland?

A.	Sturla Jonsson
B.	Davio Oddsson
C.	Katrin Jakobsdottir
D.	Gudni Johannesson
Answer: Option D


26. 	
What was the theme of 36th Association of Southeast Asian Nations (ASEAN) Summit?

A.	Corona Responsive ASEAN
B.	Cohesive and Responsive ASEAN
C.	Active and Responsible ASEAN
D.	Active and Responsive ASEAN
Answer: Option B


27. 	
The World bank enhanced the support to India's programme to rejuvenate the Ganga with how much funding through Second National Ganga River Basin Project?

A.	$300 million
B.	$400 million
C.	$500 million
D.	$600 million
Answer: Option B


28. 	
World Bank, an international financial institution, has sanctioned how much fund for "Western Economic Corridor and Regional Enhancement Phase I project" to improve road connectivity in Bangladesh?

A.	$ 750 million
B.	$ 1500 million
C.	$ 250 million
D.	$ 500 million
Answer: Option D


29. 	
SIDBI has set up which fund to facilitate free onboarding of MSMEs on Trade Receivables Discounting System platform?

A.	Atmanirbhar Crisis Responsive Fund
B.	Swavalamban Crisis Responsive Fund
C.	Local Crisis Responsive Fund
D.	Swaraj Crisis Responsive Fund
Answer: Option B


30. 	
Which country plans to establish a permanent military base in the Indian Ocean by March 2021?

A.	Iran
B.	Armenia
C.	Afghanistan
D.	Turkey
Answer: Option A


31. 	
Which country has blocked Pakistan's attempt to proscribe an Indian national as a global terrorist by the UN Security Council 1267 sanctions committee?

A.	China
B.	USA
C.	France
D.	Russia
Answer: Option B


32. 	
Who became Ireland's new prime minister?

A.	Eamon Ryan
B.	Micheal Martin
C.	Enda Kenny
D.	Simon Coveney
Answer: Option B


33. 	
Russia's Energia space corporation has announced that it is to take the first tourist on a spacewalk in which year, under the terms of a new contract with a US partner?

A.	2021
B.	2023
C.	2022
D.	2020
Answer: Option B


34. 	
WHO -led coalition ACT-Accelerator needs how much fund over the next 12 months to fight the CVOVID-19 and to develop and roll out tests, treatments and vaccines?

A.	$11.3 billion
B.	$31.3 billion
C.	$21.3 billion
D.	$41.3 billion
Answer: Option B


35. 	
Who has been sworn in as president of Malawi after winning an election rerun?

A.	Gwanda Chakuamba
B.	Lazarus Chakwera
C.	Bakili Muluzi
D.	Saulos Chilima
Answer: Option B


36. 	
What is the name of world's first yoga university launched in Los Angeles, United States of America?

A.	Ramdev Yoga University
B.	Vivekananda Yoga University
C.	Patanjali Yoga University
D.	Bharat Yoga University
Answer: Option B

37. 	
The US Space Agency, NASA has announced that its headquarters in Washington, D.C. will be named after which engineers?

A.	Mary W. Jackson
B.	Robert H. Goddard
C.	Phil Sumrall
D.	Konrad Dannenberg
Answer: Option A


38. 	
Who hosted the Russia-India-China Foreign Minister-level virtual conference following the cross border clash between Indian and Chinese troops in Galwan Valley?

A.	India
B.	Russia
C.	China
D.	USA
Answer: Option B


39. 	
45th edition of Toronto International Film Festival 2020, which is to be held virtually will be held on which dates?

A.	September 20-29
B.	September 10-19
C.	September 1-9
D.	September 15-25
Answer: Option B


40. 	
Financial Action Task Force in its 3rd and final plenary meeting under the Chinese Presidency of Xiangmin Liu retained Pakistan on the grey list till which month?

A.	November 2020
B.	December 2020
C.	July 2020
D.	October 2020
Answer: Option D


41. 	
What is the name of world's first yoga university launched in Los Angeles, United States of America?

A.	Ramdev Yoga University
B.	Vivekananda Yoga University
C.	Patanjali Yoga University
D.	Bharat Yoga University
Answer: Option B


42. 	
The US Space Agency, NASA has announced that its headquarters in Washington, D.C. will be named after which engineers?

A.	Mary W. Jackson
B.	Robert H. Goddard
C.	Phil Sumrall
D.	Konrad Dannenberg
Answer: Option A


43. 	
Who hosted the Russia-India-China Foreign Minister-level virtual conference following the cross border clash between Indian and Chinese troops in Galwan Valley?

A.	India
B.	Russia
C.	China
D.	USA
Answer: Option B


44. 	
45th edition of Toronto International Film Festival 2020, which is to be held virtually will be held on which dates?

A.	September 20-29
B.	September 10-19
C.	September 1-9
D.	September 15-25
Answer: Option B


45. 	
Financial Action Task Force in its 3rd and final plenary meeting under the Chinese Presidency of Xiangmin Liu retained Pakistan on the grey list till which month?

A.	November 2020
B.	December 2020
C.	July 2020
D.	October 2020
Answer: Option D


46. 	
Which country's court ordered the Johnson & Johnson to pay $2.1 billion in damages for causing ovarian cancer by talcum powder?

A.	Russia
B.	China
C.	USA
D.	France
Answer: Option C

47. 	
Which country has awarded the Project Management Consultancy contract to NTPC Limited in an event held on 24 June 2020?

A.	Cameroon
B.	Republic of Mali
C.	Burundi
D.	Algeria
Answer: Option B


48. 	
Which minister from India attended the 75th Victory Day Parade in Moscow's Red Square on June 24?

A.	Rajnath Singh
B.	Jitendra Singh
C.	Nirmala Sitharaman
D.	Subrahmanyam Jaishankar
Answer: Option A

49. 	
Who won the controversial parliamentary election in Serbia?

A.	Ana Brnabic
B.	Aleksandar Vucic
C.	Oliver Ivanovic
D.	Ivica Dacic
Answer: Option B


50. 	
Which country has successfully launched the last Satellite of its BeiDou Navigation Satellite System, which is a rival for the Global Positioning System of the US, to become a major space power?

A.	China
B.	Australia
C.	France
D.	New Zealand
Answer: Option A


51. 	
India has pledged to provide additional funding of how much Rs to UNRWA - United Nations Relief and Works Agency for next two years for Palestine Refugees?

A.	USD 20 million
B.	USD 10 million
C.	USD 5 million
D.	USD 15 million
Answer: Option B


52. 	
Which country has announced that it has decided to join the United Nations Arms Trade Treaty to regulate its arms sales?

A.	China
B.	Russia
C.	US
D.	Nepal
Answer: Option A

53. 	
United Nations Human Rights Council has asked which country to ensure a safe and voluntary return of Rohingya Muslims in the country?

A.	Myanmar
B.	Pakistan
C.	Bangladesh
D.	Bhutan
Answer: Option A


54. 	
The United Nations World Food Programme India have joined hands with institute to support state and national governments in achieving food and nutrition security?

A.	Institute of Food Security
B.	Indian Institute of Social Welfare and Business Management
C.	Indian Institute of Technology, Delhi
D.	Indian Institute of Information Technology
Answer: Option C


55. 	
EXIM Bank extended a Line of Credit of how much to the Government of the Republic of Nicaragua for the reconstruction of Aldo Chavarria Hospital?

A.	USD 30.10 million
B.	USD 10.10 million
C.	USD 15.10 million
D.	USD 20.10 million
Answer: Option D


56. 	
Which country signed a credit financing agreement promising 200 million euros (Rs. 1709 crore) to support the social welfare system and India's covid response?

A.	China
B.	France
C.	Russia
D.	Germany
Answer: Option B


57. 	
Mount Merapi spewed ash and hot gas in a massive column as high as 6km into the sky. Mount Merapi is located in which country?

A.	Indonesia
B.	Singapore
C.	Thailand
D.	Vietnam
Answer: Option A

58. 	
Indian officials have participated in the 32nd special Eurasian Group on Combating Money Laundering and Financing of Terrorism (EAG) plenary meeting 2020. How many countries are member of EAG?

A.	9
B.	6
C.	7
D.	5
Answer: Option A


59. 	
Which country will set up a "national security agency" in Hong Kong to administer a new law aimed at cracking down on dissent?

A.	US
B.	Russia
C.	China
D.	India
Answer: Option C


60. 	
Which company has agreed to partner with Atal Innovation Mission , NITI Aayog to proactively support the flagship mission's innovation and entrepreneurship initiatives across the country?

A.	Steel Authority of India Limited
B.	Bharat Heavy Electricals Limited
C.	Coal India Limited
D.	Bharat Petroleum Corporation Limited
Answer: Option C


61. 	
In a bid to woo Bangladesh, Which country has provided a huge trade boost to the country by announcing tariff exemption for 97 per cent of Bangladeshi products effective from July 1?

A.	China
B.	Bangladesh
C.	Sri Lanka
D.	Pakistan
Answer: Option A


62. 	
Which country will serve as the president of the United Nation security Council (15-Member) for the month of August 2021?

A.	South Africa
B.	Estonia
C.	Belgium
D.	India
Answer: Option D


63. 	
Which country will provide loan of 200 million euros to India to support Delhi's Covid response?

A.	Italy
B.	France
C.	Germany
D.	Canada
Answer: Option B

64. 	
Which country was second biggest growth driver of primary energy consumption in the world, behind China, in 2019?

A.	Brazil
B.	India
C.	Germany
D.	Russia
Answer: Option B


65. 	
According to the 32nd edition of World Competitiveness Index 2020 which country is on 1st position?

A.	Sweden
B.	Singapore
C.	France
D.	United Kingdom
Answer: Option B


66. 	
The Asian Paralympic Committee announced that the 4th Asian Youth Para Games will take place in which country?

A.	Bahrain
B.	Taiwan
C.	Mongolia
D.	Japan
Answer: Option A


67. 	
In accordance with the "SIPRI Yearbook 2020-Armaments, Disarmament and International Security", from 2019 there is an increase in the nuclear weapons stockpile of India and China. Where is SIPRI Headquarters located?

A.	Vienna
B.	Berlin
C.	Edinburgh
D.	Stockholm
Answer: Option D


68. 	
India has pledged to construct a Rs.2.33 crore sanitation facility at the Pashupatinath Temple complex in which country?

A.	Bangladesh
B.	Nepal
C.	Bhutan
D.	China
Answer: Option B


69. 	
Which country hands over first shipment of 100 ventilators to Indian Red Cross Society?

A.	USA
B.	UK
C.	France
D.	Germany
Answer: Option A


70. 	
Which United States company has become the 9th investors respectively in the Jio Platforms, as the latter has sold 0.39% stake for Rs 1,894.50 crore?

A.	AmerisourceBergen
B.	L Catterton
C.	Wells Fargo
D.	Cardinal Health
Answer: Option B


71. 	
The government of which country has decided to scrutinize the Muse-Mandalay railway project connecting Mandalay with the capital city of Yunnan province in China?

A.	Bhutan
B.	Myanmar
C.	Nepal
D.	Bangladesh
Answer: Option B


72. 	
Which country's parliament, passes bill to include India's territories of Kalapani, Limpiyadhura and Lipulekh in its new map?

A.	China
B.	Bhutan
C.	Nepal
D.	Bangladesh
Answer: Option C


73. 	
33-year-old lightweight boxing champion Oleksandr Gvozdyk also known as "The Nail" announced his retirement. He is from which country?

A.	Lebanon
B.	Jordan
C.	Ukraine
D.	Tajikistan
Answer: Option C


74. 	
The President of which country, Pierre Nkurunziza passed away at the age of 55 due to cardiac arrest?

A.	Nigeria
B.	Somalia
C.	Burundi
D.	Sudan
Answer: Option C


75. 	
How many countries have been declared as COVID-19 free till 9 June?

A.	4
B.	7
C.	9
D.	12
Answer: Option C
