1. 	
Which year's Tiger Census sets a new Guinness Record for being the world's largest camera trap wildlife survey?

A.	2013
B.	2018
C.	2019
D.	2021
Answer: Option B


2. 	
How many people have taken of healthcare services since ISt June 2020 under Ayushman Bharat Yojana?

A.	2.8 crore
B.	6.0 crore
C.	1.8 crore
D.	8.8 crore
Answer: Option D


3. 	
Energy Efficiency Services Limited inked an agreement with which Authority to install public Electric Vehicle charging stations & related infrastructure in order to promote the usage of electric vehicles?

A.	NHAI
B.	BHEL
C.	NOIDA
D.	GAIL
Answer: Option C

rt
4. 	
Which company has signed an MoU with Karnataka Governemnt to promote the arts, crafts and handloom sector of Karnataka?

A.	WHO
B.	IMF
C.	Flipkart
D.	Amazon
Answer: Option C


5. 	
Which Startup Incubator announced their partnership with the Ministry of Electronics and Information Technology and Digital India to lead the scale up program of Digital India for hardware and Internet of Things startups?

A.	T-Hub
B.	Khosla Labs
C.	Startup Village
D.	Technopark TBI
Answer: Option A


6. 	
Which organsiation will launch Amazonia-1?

A.	ISRO
B.	ESA
C.	NASA
D.	SpaceX
Answer: Option A

7. 	
With how much amount ADB will help India and 9 other nations to ensure quality education to out of school children?

A.	$ 100 million
B.	$ 200 million
C.	$ 500 million
D.	$ 1000 million
Answer: Option A


8. 	
Under the National Mission for Manuscripts, The Ministry of Culture has taken up the project of re-printing 108 volumes of Mongolian Kanjur. Who is current Union Minister of Culture?

A.	Rajnath Singh
B.	Prahlad Singh Patel
C.	Jitendra Singh
D.	Sachin Pilot
Answer: Option B


9. 	
IRDAI has allowed all general and health insurance companies to increase sum insured on Arogya Sanjeevani" beyond what amount?

A.	Rs 5 lakh
B.	Rs 50 lakh
C.	Rs 15 lakh
D.	Rs 10 lakh
Answer: Option A


10. 	
The Union Cabinet has approved the capital infusion of how much in the three Public Sector General Insurance Companies namely Oriental Insurance Company Limited, National Insurance Company Limited and United India Insurance Company Limited?

A.	Rs.12,450 crore
B.	Rs.9,450 crore
C.	Rs.16,450 crore
D.	Rs.10,450 crore
Answer: Option A


11. 	
Who is chairman of 9- member working group formed by IRDAI to look into the possibility of setting up 'Pandemic Risk Pool' to deal with the various risks arising out of a pandemic?

A.	Suresh Mathur
B.	Sandeep Bakhshi
C.	Karnam Sekar
D.	Ravneet Gill
Answer: Option A


12. 	
What is the theme of virtual India Global week 2020 organized in UK by India Inc. Group, the UK-headquartered media house?

A.	Be The Revival: India and a Corona Free World
B.	Be The Revival: India and a Better New World
C.	Be The Revival: India and a Virus Free World
D.	Be The Revival: India and a Green World
Answer: Option B


13. 	
The Central Board of Direct Taxes signed a MOU with which organisation for the data exchange between the two organisations?

A.	NASSCOM
B.	PFRDA
C.	IRDAI
D.	SEBI
Answer: Option D



14. 	
Union Cabinet has given its approval to a 10 years long (FY2020 to FY2029) pan India Central Sector Scheme namely "Agriculture Infrastructure Fund" with how much outlay?

A.	Rs. 1 Lakh Crore
B.	Rs. 4 Lakh Crore
C.	Rs. 3 Lakh Crore
D.	Rs. 2 Lakh Crore
Answer: Option A


15. 	
The 4th edition of international meeting named "Ministerial on Climate Action (MoCA)" was held on July 7, 2020. Who is current Union Minister of Environment, Forest and Climate Change of India?

A.	Prakash Javadekar
B.	Ramesh Pokhriyal 'Nishank'
C.	Dharmendra Pradhan
D.	Gajendra Singh Shekhawat
Answer: Option A



16. 	
Which two country were verified to eliminate both measles and rubella, making them the first two countries in the WHO South-East Asia region to achieve beyond their 2023 target?

A.	Malaysia and Singapore
B.	Thailand and Sri Lanka
C.	Vietnam and Indonesia
D.	Maldives and Sri Lanka
Answer: Option D


17. 	
USAID supported South Asia Group for Energy has collaborated with the Ministry of New and Renewable Energy- National Technical Institutions to increase US-India collaboration for clean energy development. Who is current Minister of New and Renewable Energy?

A.	Raj Kumar Singh
B.	Ramesh Pokhriyal 'Nishank'
C.	Dharmendra Pradhan
D.	Gajendra Singh Shekhawat
Answer: Option A


18. 	
Which country has formally notified the United Nations of its decision of withdrawal from the global health body WHO?

A.	India
B.	United States of America
C.	Germany
D.	France
Answer: Option B


19. 	
Whose term has been extended as the acting chairperson of National Company Law Appellate Tribunal by 3 month, effective from June 15?

A.	T. S. Tirumurti
B.	Bansi Lal Bhat
C.	Navin Verma
D.	M. Nair Rajeevan
Answer: Option B


20. 	
The new administrative and academic building of the Indian Agricultural research Institute at Gouria Karma in Hazaribagh, Jharkhand is named after which famous person?

A.	Dr.Shyama Prasad Mukherjee
B.	Sardar Vallabhbhai Patel
C.	Jawaharlal Nehru
D.	Bhagat Singh
Answer: Option A


21. 	
What is India's Rank according to the 11th edition of the 'Global Real Estate Transparency Index 2020' released by US based property consultant Jones Lang LaSalle's?

A.	25
B.	54
C.	34
D.	44
Answer: Option C


22. 	
Who is the head of 11-member expert committee to study impact of coronavirus on human rights of individuals, particularly marginalised and vulnerable sections of the society, together with migrant labourers?

A.	Shikha Sharma
B.	Sandeep Bakhshi
C.	Shyam Srinivasan
D.	Dr K S Reddy
Answer: Option D


23. 	
For the 1st time in the world, which country's Railways will directly supply power to Overhead Traction System of train?

A.	USA
B.	India
C.	Russia
D.	China
Answer: Option B


24. 	
Who has been appointed as the new Chief Secretary of Rajasthan replacing incumbent D.B. Gupta in the bureaucratic reshuffle amid COVID-19 pandemic?

A.	Rajiv Gauba
B.	Samant Goel
C.	Rajeeva Swarup
D.	Anil Kumar Gupta
Answer: Option C


25. 	
Last date for filing income tax returns for 2019-20 extended till which date?

A.	November 30
B.	September 30
C.	December 30
D.	October 30
Answer: Option A


26. 	
Government-owned mining majors NLC India Ltd and which company have formed a joint venture to develop solar and thermal power assets?

A.	NTPC Limited
B.	GAIL Limited
C.	NLC India Ltd
D.	Steel Authority of India Limited
Answer: Option C


27. 	
Who is the head of working group to study the suitability of insurers offering surety bonds for contractors formed by IRDAI?

A.	G. Srinivasan
B.	P. R. Seshadri
C.	Mahesh Kumar Jain
D.	P. S. Jayakumar
Answer: Option A


28. 	
What is the name of Chairman of National Highway Authority of India who gets a 6 months extension in his tenure?

A.	Nupur Mitra
B.	Alok Kumar Misra
C.	B A Prabhakar
D.	Sukhbir Singh Sandhu
Answer: Option D


29. 	
Who is the head of central Committee for reforms in Criminal Law constituted by Ministry of Home Affairs & is going to start a 3 months long online consultation exercise?

A.	Ranbir Singh
B.	P V Bharathi
C.	Sunil Mehta
D.	Sanjay Agarwal
Answer: Option A


30. 	
Who was appointed as India's Permanent Representative /Ambassador to the United Nations and the other International Organisations in Geneva?

A.	Arun Goel
B.	Indra Mani Pandey
C.	Rajesh Kotecha
D.	Jai Priye Prakash
Answer: Option B



31. 	
The World Bank approved how much fund for MSMEs Emergency Response Program to support severely impacted MSMEs in India due to COVID-19 crisis?

A.	USD 650 million
B.	USD 550 million
C.	USD 750 million
D.	USD 450 million
Answer: Option C

32. 	
Which country cancelled the 2021 Asia-Pacific Economic Cooperation forum due to the COVID-19 pandemic and is opting to lead a virtual summit?

A.	Australia
B.	New Zealand
C.	Germany
D.	Canadda
Answer: Option B


33. 	
India and which country signed an agreement for formation of 50:50 Joint Venture Company of Liquefied Petroleum Gas business?

A.	China
B.	Bangladesh
C.	Nepal
D.	Bhutan
Answer: Option B

rt
34. 	
Government announced that it will release commemorative stamp to honour which former Prime Minister after celebrating his 100th birth anniversary on June 28, 2020?

A.	Atal Bihari Vajpayee
B.	PV Narasimha Rao
C.	Inder Kumar Gujral
D.	H. D. Deve Gowda
Answer: Option B


35. 	
The Ministry of Electronics and Information Technology has decided to ban how many apps due to their activities which are prejudicial to sovereignty and integrity of India, security of state and public order?

A.	69
B.	39
C.	59
D.	49
Answer: Option C


36. 	
The Government has added three more states Odisha, Mizoram, and Sikkim under the One nation, one ration card scheme. With this, the scheme now covers a total of how many states & UTs?

A.	18
B.	22
C.	20
D.	15
Answer: Option C


37. 	
Who has been re-appointment as Solicitor General for a period of three years?

A.	Madhavi Goradia
B.	Tushar Mehta
C.	Aruneshwar Gupta
D.	Anitha Shenoy
Answer: Option B


38. 	
The Government will launch the 4th phase of 'Vande Bharat Mission' from which date?

A.	August 3, 2020
B.	July 31, 2020
C.	August 31, 2020
D.	July 3, 2020
Answer: Option D


39. 	
PM Modi extended the Pradhan Mantri Garib Kalyan Yojana till which month to support migrants and poor labourers?

A.	August 2020
B.	September 2020
C.	November 2020
D.	December 2020
Answer: Option C


40. 	
India and which country signed the first joint venture hydroelectric project on 29 June 2020?

A.	China
B.	Nepal
C.	Bhutan
D.	Pakistan
Answer: Option C


41. 	
President of India promulgated the Banking Regulation (Amendment) Ordinance, 2020 to ensure the safety of depositors across banks. Who is current President of India?

A.	Venkaiah Naidu
B.	Pratibha Patil
C.	Pranab Mukherjee
D.	Ram Nath Kovind
Answer: Option D


42. 	
Who launched the official Logo for the Golden Jubilee Commemoration Year celebration of Department of Science and Technology?

A.	Heeralal Samariya
B.	Ruolkhumlien Buhril
C.	Ashutosh Sharma
D.	Navin Verma
Answer: Option C


43. 	
Which Indian Weightlifter will get the Arjuna award for 2018?

A.	Mirabai Chanu
B.	Sukhen Dey
C.	Sathish Sivalingam
D.	K. Sanjita Chanu
Answer: Option D


44. 	
United Nations International Day in Support of Victims of Torture is observed annually on which day to raise awareness about the crime of torture?

A.	June 22
B.	June 26
C.	June 24
D.	June 23
Answer: Option B


45. 	
Who inaugurated the Battery Swapping Facility Quick Interchange Service at Chandigarh?

A.	D.V. Sadananda Gowda
B.	Ravi Shankar Prasad
C.	Nirmala Sitharaman
D.	Dharmendra Pradhan
Answer: Option D


46. 	
Who is the head of 9-member working group to suggest insurance products covering risks involved in the use of Remotely Piloted Aircraft System(RPAS)/ Drones formulated by IRDAI?

A.	Girish Radhakrishnan
B.	Anjan Dey
C.	A V Girija Kumar
D.	Shiva Ayyadurai
Answer: Option B

47. 	
Who has launched 'eBloodServices' mobile app developed by the ERaktkosh team of C-DAC India for easy access to blood needed for transfusion?

A.	Narendra Modi
B.	Amit Shah
C.	Nirmala Sitharaman
D.	Harsh Vardhan
Answer: Option D


48. 	
Cabinet has approved the further extension of the term of the Commission formulated to examine the issue of Sub-categorization of Other Backward Classes by how many months?

A.	2 months
B.	4 months
C.	5 months
D.	6 months
Answer: Option D


49. 	
Which Airport becomes the 1st airport in India to get an indigenously-developed Aviation Weather Monitoring System at both ends of the runway?

A.	Indira Gandhi International Airport
B.	Chennai International Airport
C.	Begumpet Airport
D.	Kempegowda International Airport
Answer: Option D


50. 	
Who inaugurated two important Bridges namely Devika and Puneja in Udhampur and Doda districts respectively in Jammu & Kashmir through the virtual platform?

A.	Nitin Jairam Gadkari
B.	Jitendra Singh
C.	Nirmala Sitharaman
D.	Raj Nath Singh
Answer: Option B


51. 	
The Union Cabinet headed by the Prime Minister Narendra Modi approved setting up of Animal Husbandry Infrastructure Development Fund and for this the Centre has allocated a sum of how much Rs?

A.	Rs.25000 crore
B.	Rs.35000 crore
C.	Rs.5000 crore
D.	Rs.15000 crore
Answer: Option D


52. 	
Union Cabinet chaired by the Prime Minister Narendra Modi approved the declaration of which Airport in Uttar Pradesh as an International Airport?

A.	Lucknow Airport
B.	Kushinagar Airport
C.	Gorakhpur Airport
D.	Hindon Airport
Answer: Option B


53. 	
Who launched an initiative 'YUKTI 2.0' to help systematically assimilate technologies having commercial potential and information related to incubated startups in higher education institutions?

A.	Ramvilas Paswan
B.	Harsimrat Kaur Badal
C.	Ramesh Pokhriyal 'Nishank'
D.	Narendra Singh Tomar
Answer: Option C


54. 	
Who has launched the Food Processing Edition of the Exclusive Investment Forum hosted by Invest India?

A.	Prakash Javadekar
B.	D.V. Sadananda Gowda
C.	Narendra Singh Tomar
D.	Harsimrat Kaur Badal
Answer: Option D


55. 	
India asks Pakistan to reduce High Commission staff by how much percent within a week?

A.	20%
B.	50%
C.	30%
D.	10%
Answer: Option B


56. 	
Department of Agriculture, Cooperation & Farmers' Welfare under Make in India initiative indigenously develop a vehicle-mounted ULV sprayer for locust control. Who is current Union Agriculture Minister?

A.	Prakash Javadekar
B.	D.V. Sadananda Gowda
C.	Narendra Singh Tomar
D.	Harsimrat Kaur Badal
Answer: Option C


57. 	
Union Minister of State of Development of North Eastern Region Dr Jitendra Singh has sanctioned how much fund for augmentation of healthcare facility in the eight North Eastern States?

A.	Rs.190 crore
B.	Rs.390 crore
C.	Rs.290 crore
D.	Rs.490 crore
Answer: Option A


58. 	
Who inaugurate Virtual India Pavilion at the Cannes Film Festival 2020?

A.	Ravi Shankar Prasad
B.	Raj Nath Singh
C.	Prakash Javadekar
D.	Amit Shah
Answer: Option C


59. 	
Which organisation in collaboration with International Transport Forum will launch the "Decarbonising Transport in India" project on 24 June?

A.	Central Road Research Institute
B.	Ministry of Road Transport and Highways
C.	Ministry of Civil Aviation
D.	NITI Aayog
Answer: Option D


60. 	
Who is head of high-powered committee by NITI Aayog to develop a job platform that will help migrant labours & blue-collar workers, who have lost their jobs during the lockdown?

A.	Samant Goel
B.	Amitabh Kant
C.	Rajiv Gauba
D.	V. P. Joy
Answer: Option B



61. 	
What is the nickname of 66-million-year-old egg (second-largest egg in the world) found in Antarctica's Seymour Island?

A.	The Sphere
B.	The Thing
C.	The Egg
D.	The Rock
Answer: Option B


62. 	
Which Metro has decided to convert a station into a "She-Man" station that will have special facilities and employment for the transgender community?

A.	Noida-Greater Noida Metro
B.	Jaipur Metro
C.	Kolkata Metro
D.	Delhi Metro
Answer: Option A


63. 	
According to the Bloomberg Billionaires Index released on 20 June 2020 what is Mukesh Ambani rank in world's top richest people?

A.	6
B.	9
C.	15
D.	18
Answer: Option B


64. 	
What was the theme of International Day of Yoga 2020?

A.	Yoga for Everyone - Yoga at Home
B.	Yoga for Health - Yoga in Life
C.	Yoga for Health - Yoga at Home
D.	Yoga for Corona - Yoga in Life
Answer: Option C


65. 	
Approximately how many people have received Rs 65,454 crore in financial assistance under the Pradhan Mantri Garib Kalyan Package?

A.	42 crore
B.	82 crore
C.	22 crore
D.	62 crore
Answer: Option A

66. 	
The two-day India Ideas Summit 2020 will be held virtually on which dates with the focus on geopolitics in the post-COVID-19 world?

A.	June 21-22
B.	June 27-28
C.	July 21-22
D.	July 27-28
Answer: Option C


67. 	
The Ministry of New and Renewable Energy has set up a Project Development Cell under whom to attract investment in clean energy, especially in the solar sector?

A.	Pankaj Patel
B.	Balesh Sharma
C.	Amitesh Kumar Sinha
D.	Varun Berry
Answer: Option C


68. 	
What is the name of mobile application launched by the Municipal Corporation of Greater Mumbai to help residents in the city to know about the availability of the ICU beds and Ventilators?

A.	Venti-ICU
B.	Mum-Air
C.	Air-Venti
D.	Corona-Care
Answer: Option C


69. 	
Reliance Industries Limited's Jio Platforms stepped into 11th deal with which company, who bought 2.32% stake in Jio Platforms for Rs 11,367 crores?

A.	Al Rajhi Banking & Investment Corporation.
B.	Jabal Omar Development Co.
C.	Saudi Electricity Co.
D.	Saudi Arabia's Public Investment Fund
Answer: Option D


70. 	
What is the name of the youngest known magnetar discovered by NASA?

A.	Magne J1818.0-1607
B.	Swift J1818.0-1607
C.	Neutr J1818.0-1607
D.	Star J1818.0-1607
Answer: Option B


71. 	
India released its first national report on the state of the climate crisis titled "Assessment of climate change over the Indian region". Who published this report?

A.	MacMillan India Ltd.
B.	Spring Nature
C.	Taxman Publications Limited
D.	Hachette India
Answer: Option B


72. 	
Prime Minister Narendra Modi has launched the two stage electronic auction of how many coal blocks for commercial mining through video-conference?

A.	41
B.	31
C.	34
D.	51
Answer: Option A


73. 	
The Competition Commission of India approved the acquisition of Metso Oyj's minerals business by which company under section 31(1) of the Competition Act, 2002?

A.	Barrick Gold
B.	Newmont Mining
C.	Outotec Oyj
D.	Fresnillo
Answer: Option C


74. 	
Which institute has developed a herbal infusion technology, as a source of income for local marginal farmers in the mid-Himalayas?

A.	Malaviya National Institute of Technology Jaipur
B.	Tata Institute of Fundamental Research
C.	Indian Institute of Technology Mandi
D.	Wadia Institute of Himalayan Geology
Answer: Option C


75. 	
Tata AIA Life Insurance partnered with which company to offer Aadhaar-based paperless offline e-Know Your Customer service?

A.	SMCinternational ltd.
B.	HDFC Bank Limited
C.	Bharti Airtel Limited
D.	East Consultancy Services
Answer: Option D
