1. 	
Hockey India Executive Board held an Emergent Executive Board meeting named Gyanendro Ningombam as the Officiating President of Hockey India. He is from which state?

A.	MP
B.	Haryana
C.	Manipur
D.	Punjab
Answer: Option C


2. 	
Prime Minister Narendra Modi inaugurated the 750 MW Solar Project set up in which state?

A.	Odisha
B.	Bihar
C.	Madhya Pradesh
D.	UP
Answer: Option C

3. 	
Which state Chief Minister was honoured with Paul Harris Fellow recognition?

A.	Kerala
B.	Bihar
C.	Haryana
D.	Tamil Nadu
Answer: Option D


4. 	
Which state organised India's first e-Lok Adalat to ensure the administration of justice and to solve the financial crisis of the parties and lawyers amid COVID-19 pandemic?

A.	Bihar
B.	Chhattisgarh
C.	Gujarat
D.	MP
Answer: Option B


5. 	
Which state goevrnment has approved a new startup policy recently?

A.	UP
B.	Bihar
C.	Maharashtra
D.	Haryana
Answer: Option A6. 	
Which state has inaugurated 5 water supply prpjects recently?

A.	Manipur
B.	Mahdya Pradesh
C.	Gujarat
D.	Assam
Answer: Option A


7. 	
Maharashtra governemnt will set up stress fund with the help of which bank?

A.	SBI
B.	RBI
C.	Yes Bank
D.	HDFC Bank
Answer: Option A


8. 	
Who has inaugurated Rewa Ultra Mega Solar Power Project in Madhya Pradesh?

A.	Amit Shah
B.	Raj Nath Singh
C.	Narendra Modi
D.	Nitin Jairam Gadkari
Answer: Option C


9. 	
Which State Chief Minister launched the BLUIS, a flagship development of the General Administration and Public grievances departments?

A.	Madhya Pradesh
B.	Karnataka
C.	Odisha
D.	West Bengal
Answer: Option C


10. 	
Which State launched the week long campaign "Pure for Sure" from 8th July 2020 to 14th July 2020 - to ensure the purity of the milk and dairy products?

A.	Jammu and Kashmir
B.	Bihar
C.	Rajasthan
D.	Gujarat
Answer: Option C

6. 	
Which state has inaugurated 5 water supply prpjects recently?

A.	Manipur
B.	Mahdya Pradesh
C.	Gujarat
D.	Assam
Answer: Option A

Explanation:

Manipur Chief Minister (CM) N. Biren Singh inaugurates 5 Water Supply projects worth Rs 48.39 crore, which have a total capacity of more than 26.15 millions of liters per day(MLD) through video conferencing from the Chief Minister's Secretariat, Imphal. With addition to the projects one office building of Weight and Measures Department and Rapid Antigen Detection Testing Centre at Jiribam were also inaugurated.
View Answer Discuss in Forum Workspace Report
7. 	
Maharashtra governemnt will set up stress fund with the help of which bank?

A.	SBI
B.	RBI
C.	Yes Bank
D.	HDFC Bank
Answer: Option A


8. 	
Who has inaugurated Rewa Ultra Mega Solar Power Project in Madhya Pradesh?

A.	Amit Shah
B.	Raj Nath Singh
C.	Narendra Modi
D.	Nitin Jairam Gadkari
Answer: Option C


9. 	
Which State Chief Minister launched the BLUIS, a flagship development of the General Administration and Public grievances departments?

A.	Madhya Pradesh
B.	Karnataka
C.	Odisha
D.	West Bengal
Answer: Option C

10. 	
Which State launched the week long campaign "Pure for Sure" from 8th July 2020 to 14th July 2020 - to ensure the purity of the milk and dairy products?

A.	Jammu and Kashmir
B.	Bihar
C.	Rajasthan
D.	Gujarat
Answer: Option C

11. 	
Which State government has imposed statewide lockdown from 10th July to 13th July 2020 to check the spread of novel Coronavirus and other communicable diseases?

A.	Rajasthan
B.	Uttar Pradesh
C.	Karnataka
D.	Tamil Nadu
Answer: Option B


12. 	
Bar Council of Delhi has requested PM Narendra Modi for financial assistance of how much under the PM Cares Fund and Contingency Fund to help the advocates in Delhi NCR?

A.	Rs 500 crore
B.	Rs 200 crore
C.	Rs 300 crore
D.	Rs 250 crore
Answer: Option A

13. 	
According to data from the Reserve Bank of India, which State has topped market borrowings among States in India with a collection of Rs.30,500 crore in the fiscal 2020-21?

A.	Tamil Nadu
B.	Haryana
C.	Andhra Pradesh
D.	West Bengal
Answer: Option A

14. 	
World's 2nd Largest & Asia's Largest Data Center, 'Yotta NM1 Data Center' of Yotta Infrastructure of Hiranandani Group is located in which Indian state?

A.	Madhya Pradesh
B.	Maharashtra
C.	Bihar
D.	Haryana
Answer: Option B


15. 	
A 3 member team has discovered a new species of a fan-throated lizard, Sitana dharwarensis, from the barren lands of which Indian state?

A.	Karnataka
B.	Telangana
C.	Andhra Pradesh
D.	Uttar Pradesh
Answer: Option A

16. 	
Who unveiled Bhubaneswar Land Use Intelligence System which would monitor changes in all government lands in Odisha by leveraging high-resolution satellite imagery?

A.	Hemananda Biswal
B.	Giridhar Gamang
C.	Janaki Ballabh Pattanaik
D.	Naveen Patnaik
Answer: Option D


17. 	
Which Indian State celebrated Rythu Dinotsavam (Farmer's Day) to mark the 71st birth anniversary of YS Rajasekhara Reddy?

A.	Karnataka
B.	Telangana
C.	Odisha
D.	Andhra Pradesh
Answer: Option D

18. 	
Which State chief minister launched the 'Maha Jobs Portal' an online platform to provide employment opportunities to local residents of the state by connecting job seekers with employers?

A.	Telangana
B.	Maharashtra
C.	West Bengal
D.	Odisha
Answer: Option B


19. 	
"Intzaar Aap Ka" campaign is started by which state over the social media platform to attract tourists with taglines and the description of the tourism destinations of the State?

A.	Rajasthan
B.	Gujarat
C.	Madhya Pradesh
D.	Punjab
Answer: Option C


20. 	
Which State government has decided to upgrade the 111.942 sq km Dehing Patkai Wildlife Sanctuary into a national park which is located within the larger Dehing Patkai Elephant Reserve?

A.	Assam
B.	Maharashtra
C.	West Bengal
D.	Odisha
Answer: Option A

21. 	
Which State Chief Minister launches "SelfScan" app developed by the state's Information Technology department as an alternative to Camscanner?

A.	West Bengal
B.	Jharkhand
C.	Karnataka
D.	Uttar Pradesh
Answer: Option A


22. 	
Which State launched "Weavers Samman Yojana" to provide financial assistance of Rs 2000 for about 19,744 handloom weavers in the state, through Direct Benefit Transfer?

A.	Madhya Pradesh
B.	Jharkhand
C.	Karnataka
D.	Uttar Pradesh
Answer: Option C


23. 	
Which Indian State has become the first state where all the households have LPG gas connections?

A.	Himachal Pradesh
B.	Arunachal Pradesh
C.	Madhya Pradesh
D.	Uttar Pradesh
Answer: Option A


24. 	
Which State Cabinet has approved the draft ordinance for reservation of 75% jobs in private sector for youth of the state?

A.	Haryana
B.	Bihar
C.	Jharkhand
D.	Punjab
Answer: Option A


25. 	
Which State/UTs launched Mission Organic Development Initiative and Greenhouse Project, to lead on a sustainable path, over a virtual platform?

A.	Punjab
B.	Haryana
C.	Delhi
D.	Ladakh
Answer: Option D


26. 	
PM Narendra Modi will on July 10, 2020 inaugurate the Asia's largest solar power plant in which state?

A.	Madhya Pradesh
B.	Bihar
C.	Rajasthan
D.	Haryana
Answer: Option A


27. 	
World's largest 10,000-bed Sardar Patel COVID Care Centre is inaugurated in which city?

A.	Chennai
B.	Mumbai
C.	Delhi
D.	Gurugram
Answer: Option C


28. 	
The Administration of the Union Territory of Ladakh launched the Ladakh Food Security Scheme. Who is current Lieutenant Governor of Union Territory of Ladakh?

A.	Jagdish Mukhi
B.	Biswa Bhusan Harichandan
C.	Phagu Chauhan
D.	Radha Krishna Mathur
Answer: Option D


29. 	
The UK India Business Council signed a Memorandum of Understanding with which state Industrial Development Corporation?

A.	Uttar Pradesh
B.	Bihar
C.	Haryana
D.	Maharashtra
Answer: Option D


30. 	
Which State/ UT Government has launched an e-learning portal name as LEAD which comprises of 10,000 instructional materials and course content for students of Classes I to XII?

A.	Punjab
B.	Delhi
C.	Haryana
D.	Goa
Answer: Option B


31. 	
Mission Vriksharopan-2020 campaign has been launched by the which state government?

A.	Uttar Pradesh
B.	Haryana
C.	Punjab
D.	Bihar
Answer: Option A

32. 	
Which State Government launched 1st of its kind scheme, 'Balaram' to provide agricultural credit of Rs 1,040 crore to landless farmers facing hardships during COVID 19?

A.	Rajasthan
B.	Bihar
C.	Odisha
D.	Telangana
Answer: Option C

33. 	
What is the name of 17 day campaign which will be launched from July 10 to July 26 from the National Highway 20 near ITO to reduce air pollution?

A.	Podhe Ugao, Paryavaran Bachao
B.	Podhe Lagao, Paryavaran Bachao
C.	Podhe Ugao, Desh Bachao
D.	Podhe Lagao, Desh Bachao
Answer: Option B


34. 	
Which State Government announced that Marathi writer and playwright Ratnakar Matkari will be posthumously honoured with the Natvarya Prabhakar Panshikar award for his lifetime contribution to the theaters and arts?

A.	Maharashtra
B.	Bihar
C.	Rajasthan
D.	Haryana
Answer: Option A

35. 	
Initiative 'Sabuja Odisha' launched in Odisha state is related to which mission?

A.	Increase green cover
B.	Increase Financial inclusion
C.	Increase Covid cover
D.	Increase Health cover
Answer: Option A                         
                                                
                                                
36. 	
The District Administration of Mon, from which state received 2020 SKOCH awards under three categories?

A.	Nagaland
B.	Assam
C.	Sikkim
D.	Tripura
Answer: Option A


37. 	
The Governor of Telangana has amended the Telangana Fiscal Responsibility and Budget Management Act-2005 which will enable the State to increase the borrowing limit by how much percent from earlier 3%?

A.	3%
B.	1%
C.	4%
D.	2%
Answer: Option D


38. 	
A MoU was signed between which company and South Delhi Municipal Corporation on setting up a waste to energy plant at Okhla in Delhi?

A.	ONGC and SAIL
B.	Indian Oil and NTPC Ltd
C.	NBCC and BEML ltd.
D.	GAIL and BPCl
Answer: Option B

39. 	
The Government of India declared which state as a "disturbed area" for another six months from 30 June, 2020 to 31, December, 2020?

A.	Telangana
B.	Odisha
C.	Nagaland
D.	Tamilnadu
Answer: Option C

40. 	
Which State Government allotted land to a consortium of 49 MSME units to set up India's first Maritime Cluster?

A.	Goa
B.	Punjab
C.	Bihar
D.	Odisha
Answer: Option A           
                                                
                                                
 41. 	
Which State launched "Hamara Ghar-Hamara Vidyalaya" scheme to maintain academic regularity of the students during the Lockdown due to COVID-19 pandemic?

A.	Rajasthan
B.	West Bengal
C.	Madhya Pradesh
D.	Karnataka
Answer: Option C


42. 	
Which state Chief Minister launched a portal, 'Skill Connect Forum' to connect job seekers and employers on a common platform?

A.	Punjab
B.	Karnataka
C.	Bihar
D.	Odisha
Answer: Option B

t
43. 	
In a big boost to Aatma Nirbhar Assam, Council of Ministers of Assam has passed the MSME Ordinance during the meeting held in presence of Chief Minister. Who is the current Chief Minister of Assam?

A.	Zoramthanga
B.	Bhupesh Baghel
C.	Neiphiu Rio
D.	Sarbananda Sonowal
Answer: Option D


44. 	
Central Government has sanctioned an additional funding of how much for the construction of highways by BRO in J&K and Uttarakhand during 2020-21 in the wake of clashes with China in Ladakh?

A.	Rs 1,491 crore
B.	Rs 1,691 crore
C.	Rs 1,591 crore
D.	Rs 1,791 crore
Answer: Option B

45. 	
Which State Government will be launching 'Kill Corona' campaign with effect from July 1, 2020?

A.	Karnataka
B.	Madhya Pradesh
C.	Punjab
D.	Maharashtra
Answer: Option B                                       
                                                
                                                
46. 	
Which Indian State and the World Bank signed an agreement to help low-income groups to get access to affordable housing?

A.	Tamil Nadu
B.	Karnataka
C.	Maharashtra
D.	Odisha
Answer: Option A


47. 	
Which State has developed India's First Lichen Park as a research centre with over 150 Lichen species?

A.	Kerala
B.	Assam
C.	Uttarakhand
D.	Nagaland
Answer: Option C


48. 	
Which State/UT government will start its own 'Plasma Bank' for treatment of Coronavirus positive patients?

A.	Kerala
B.	Punjab
C.	Uttarakhand
D.	Delhi
Answer: Option D


49. 	
Which State launched the world's largest plasma therapy trials for the COVID-19 "Project Platina"?

A.	Rajasthan
B.	Telangana
C.	Maharashtra
D.	Madhya Pradesh
Answer: Option C


50. 	
Which State launched the online aid initiative 'At One Click' with Rs 1,369 crore for around 13000 MSME?

A.	Bihar
B.	Gujarat
C.	Andhra Pradesh
D.	Jharkhand
Answer: Option B                          
                                                
                                                
51. 	
The lockdown in Maharashtra has been extended till which date for containment of COVID-19 pandemic?

A.	July 25, 2020
B.	July 31, 2020
C.	August 1, 2020
D.	August 31, 2020
Answer: Option B


52. 	
How many Districts hospitals of the union territory of Jammu & Kashmir won the Kayakalap Award for their achievements in the health sector and secured positions in the best hospital category 2019-2020?

A.	6
B.	2
C.	4
D.	5
Answer: Option A


53. 	
Which state panchayati raj department wins 1st prize under e-Panchayat Puraskars 2020 for effective implementation of e-applications, developed by the central government?

A.	Haryana
B.	Himachal Pradesh
C.	Uttarakhand
D.	Punjab
Answer: Option B


54. 	
Arunachal Pradesh state government is to implement Jal Jeevan Mission in the State and aims to provide 100% Functional Household Tap Connections to all the households of the State by which year?

A.	2023
B.	2021
C.	2022
D.	2025
Answer: Option A


55. 	
Adarsh Police stations scheme will be launched in which state?

A.	Punjab
B.	Haryana
C.	Chhattisgarh
D.	Bihar
Answer: Option C                                               
                                                
                                                

56. 	
Who assumed charge as Punjab's first woman chief secretary on 26 June 2020?

A.	Rashmi Verma
B.	Vini Mahajan
C.	Shakuntala Gamlin
D.	Renu Swarup
Answer: Option B

57. 	
Which State's Chief Minister announced the launch of 'Godhan Nyay Yojana' in the state on June 25, 2020?

A.	Punjab
B.	Haryana
C.	Chhattisgarh
D.	Telangana
Answer: Option C


58. 	
Which State announced the "Maha Parwana" to attract fresh investment in industries, for project execution, this plan will offer incentives and a single window clearance system?

A.	Madhya Pradesh
B.	Rajasthan
C.	Karnataka
D.	Maharashtra
Answer: Option D

59. 	
Who launched the Kapu Nestham scheme to provide financial support of Rs 75000/- for a period of 5 year (Rs 15000/- per annum) to women of Kapu community?

A.	Nitish Kumar
B.	Sarbananda Sonowal
C.	YS Jagan Mohan Reddy
D.	Pema Khandu
Answer: Option C


60. 	
Who has rolled out 2 customized loan schemes of J&K Bank namely 'J&K Bank Business Support Loan Scheme 2019-20' and 'J&K Bank Business Support Loan Scheme 2019-20 for Hotels and Guest Houses'?

A.	Girish Chandra Murmu
B.	B.V.R. Subrahmanyam
C.	Baseer Ahmad Khan
D.	Farooq Khan
Answer: Option A 
 

61. 	
Which State forest department declared the 29.53 square kilometre Tillari forest area in Dodamarg and Sawantwadi range as a conservation reserve area?

A.	Madhya Pradesh
B.	Andhra Pradesh
C.	Maharashtra
D.	Tamil Nadu
Answer: Option C


62. 	
Which state Becomes the First State to Amend Industries (Facilitation) Act for Small, Medium and Large-scale Industries?

A.	Tamil Nadu
B.	Madhya Pradesh
C.	Karnataka
D.	Andhra Pradesh
Answer: Option C


63. 	
Who will host the 2023 Women's World Cup Football tournament?

A.	Australia and New Zealand
B.	Croatia
C.	France
D.	United States of America
Answer: Option A


64. 	
The Central Government has allocated how much rupees to Tamil Nadu for rejuvenating the Small, Medium and Tiny industries sector?

A.	4125 crore
B.	3125 crore
C.	2125 crore
D.	1125 crore
Answer: Option A


65. 	
Who is the head of high level committee to investigate the blowout at Assam's Baghjan oil well of Oil India Limited formed by the National Green Tribunal?

A.	Madan Lokur
B.	Prafulla Chandra Pant
C.	Sangita Dhingra Sehgal
D.	BP Katakey
Answer: Option D


66. 	
Who has been appointed as Chief Secretary of Maharashtra government?

A.	Navin Verma
B.	Sanjay Kumar
C.	A Gitesh Sarma
D.	Ruolkhumlien Buhril
Answer: Option B


67. 	
According to the Annual "India TB (Tuberculosis) Report 2020" there was about how much percent increase in TB patients as compared to the year 2018?

A.	12%
B.	15%
C.	8%
D.	14%
Answer: Option D


68. 	
Which state government has launched Mukhyamantri Matru Pushti Uphaar scheme to provide nutrition kits to pregnant and lactating women?

A.	Arunachal Pradesh
B.	Assam
C.	Tripura
D.	Sikkim
Answer: Option C


69. 	
Which state is set to launch a 100-day employment scheme "Mukhyamantri SHRAMIK Yojna" to enhance the livelihood and security of urban poor?

A.	Rajasthan
B.	Haryana
C.	Jharkhand
D.	Bihar
Answer: Option C

70. 	
Which state introduced the Nishtha Vidyut Mitra Scheme for women empowerment?

A.	Haryana
B.	Jharkhand
C.	Madhya Pradesh
D.	Maharashtra
Answer: Option C


71. 	
Which state has signed an agreement with Reliance Jio TV to benefit around 52 lakh rural students during the COVID-19 pandemic?

A.	Jharkhand
B.	Rajasthan
C.	Haryana
D.	Delhi
Answer: Option C

72. 	
The Union government has allocated how much fund for the effective implementation of JJM in Telangana for FY 2020-21?

A.	Rs 412.19 Crore
B.	Rs 612.19 Crore
C.	Rs 312.19 Crore
D.	Rs 212.19 Crore
Answer: Option A


73. 	
Which state Government will soon launch the Indira Rasoi Yojana to fulfill the resolution of 'No one Sleeps Hungry'?

A.	Maharashtra
B.	Rajasthan
C.	Uttarakhand
D.	Kerala
Answer: Option B

74. 	
Which state government has signed a tripartite agreement with the Power Grid Corporation of India and the Educational Consultants India Limited to set up smart classrooms in 100 schools with a cost of Rs 1.85 crore?

A.	Uttar Pradesh
B.	Rajasthan
C.	Haryana
D.	Punjab
Answer: Option B


75. 	
Which state government has decided to launch a scheme called 'Ektu Khelo, Ektu Padho' which means 'Play little, Study little', from June 25, 2020?

A.	Tripura
B.	West Bengal
C.	Sikkim
D.	Assam
Answer: Option 
